<!DOCTYPE HTML>
<html>
 <head>
  <meta charset="utf-8">
  <title>HOW-TO:Программа на Python, Часть 1</title>
  <style> body {margin-left: 100px;}
  </style>
 </head>
 <body>
    <h1>HOW-TO:Программа на Python, Часть 1</h1>
    <ul>
        <li ><em>Программа на Python, часть 1</em></li>
        <li ><em>Программа на Python, часть 2</em></li>
        <li ><em>Программа на Python, часть 3</em></li>
    </em></ul>
    <h2>Содержание</h2>
    <p><b>HOW-TO:Программа на Python, Часть 1</b></p>
    <ul>
      <li><u>Наша первая программа</u></li>
      <li><u>Пример цикла For</u></li>
    </ul>
    <p>Из множества существующих языков Python &mdash; один из самых легких в изучении. 
       Он создан в конце 80-годов XX века, но с тех пор он сильно изменился. Хотя Python
       входит в состав большинства диструбутивов Linux, на него часто не обращают внимания 
       при выборе язывка для изучения. В этой статье мы рассмотрим создание консольных 
       приложений, а в следующей &mdash; программирование графических интерфейсов (GUI).
       Давайте создадим простую программу прямо сейчас. 
       </p>
       <h2>Наша первая программа</h2>
       <p>Наберем код в текстовом редакторе (например, в gedit). Потом мы разберемся, что делает 
         каждая строка и пойдем дальше. </p>
       <p>Введите эти четыре строки</p>
       <br>
       <p><code>  
         #!/usr/bin/env python3 <br>
         print ("Hello. I am a python program.") <br>
         name = input("What is your name?") <br>
         print ("Hello there, " + name + "!")</code>
         <p>Это всё. Сохраните файл как <strong>hello.py</strong> в любом месте. Я предлагаю
             сохранить его в папке <strong>python_examples</strong> в домашнем каталоге.
             Этот пример показывает, как просто написать программу на Python.
             Для запуска программы нужно сделать её файл исполняемым. 
             Для этого введите в терминале</p>
             <p><ins><strong>chmod +x hello.py</strong></ins></p>
             <p>в папке, в которой вы сохранили программу. Теперь запустите её.</p>
             <br>
             <p><code>greg@earth:~/python_examples$ ./hello.py <br>
               Hello. I am a python program. <br>
               What is your name? Ferd Burphel <br>
               Hello there, Ferd Burphel! <br>
               greg@earth:~/python_examples$</code></p>
               <p><b>Вот и всё.</b></p>
               <br>
               <h2>Пример цикла For</h2>
               <p>Теперь давайте рассмотрим пример программирования цикла. Запустите текстовый 
                  редактор и наберите следующую программу:</p>
                  <br>
                  <p><code>
                     #!/usr/bin/env python3 <br>
                     for cntr in range(0,10): <br>
                     print (cntr)
                  </code></p>
                  <p>Не забудьте поставить символ табуляции перед строкой <u>«print (cntr)»</u>.
                      <b>Это важно</b>. В Python для указания на блоки кода используются не круглые 
                      «(» и фигурные «{» скобки как в других языках программирования, а отступы.
                      Сохраните программу под именем «for_loop.py». До её запуска давайте поговорим о том,
                       что такое цикл «for».</p>

 </body>
</html>